In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
from statsmodels.tsa.stattools import ccf

In [ ]:
# Set pandas formatting options
pd.set_option('display.max_columns', None)
pd.set_option('display.expand_frame_repr', False)
pd.set_option('max_colwidth', 500)

In [ ]:
# Load stocks data for Microsoft and Apple
stocks_df = pd.read_csv('https://raw.githubusercontent.com/MIE223-2025/course-datasets/main/stock_data.csv', index_col='Date', parse_dates=True) # Significant to have index as date
stocks_df = stocks_df[(stocks_df['company_name'] == 'MICROSOFT') | (stocks_df['company_name'] == 'APPLE')]

# Keep only the columns we need (company_name, Adj Close)
stocks_df = stocks_df[['company_name', 'Adj Close']]
stocks_df

           company_name   Adj Close
Date
2019-02-19        APPLE   41.138523
2019-02-20        APPLE   41.403271
2019-02-21        APPLE   41.169807
2019-02-22        APPLE   41.629509
2019-02-25        APPLE   41.932755
...                 ...         ...
2024-02-12    MICROSOFT  414.493500
2024-02-13    MICROSOFT  405.570007
2024-02-14    MICROSOFT  409.489990
2024-02-15    MICROSOFT  406.559998
2024-02-16    MICROSOFT  404.059998

[2518 rows x 2 columns]

In [ ]:
# Separate dataframe for Microsoft stocks
microsoft_df = stocks_df[stocks_df['company_name'] == 'MICROSOFT']
microsoft_df = microsoft_df.drop(columns=['company_name']) # Drop the company_name column
microsoft_df.head()

             Adj Close
Date
2019-02-19  102.528320
2019-02-20  101.995255
2019-02-21  104.146538
2019-02-22  105.631493
2019-02-25  106.221664

In [ ]:
# Separate dataframe for Apple stocks
apple_df = stocks_df[stocks_df['company_name'] == 'APPLE']
apple_df = apple_df.drop(columns=['company_name']) # Drop the company_name column
apple_df.head()

            Adj Close
Date
2019-02-19  41.138523
2019-02-20  41.403271
2019-02-21  41.169807
2019-02-22  41.629509
2019-02-25  41.932755

In [ ]:
# Load temperature data
temperature_df = pd.read_csv('https://raw.githubusercontent.com/MIE223-2025/course-datasets/main/cities_temperature.csv')
temperature_df.head()

                    Region    Country  State    City  Month  Day  Year  AvgTemperature
0  Australia/South Pacific  Australia    NaN  Sydney      1    1  1995            59.1
1  Australia/South Pacific  Australia    NaN  Sydney      1    2  1995            64.6
2  Australia/South Pacific  Australia    NaN  Sydney      1    3  1995            79.1
3  Australia/South Pacific  Australia    NaN  Sydney      1    4  1995            77.3
4  Australia/South Pacific  Australia    NaN  Sydney      1    5  1995            70.2

In [ ]:
# Cities of interest
city_1 = "Calgary"
city_2 = "Buenos Aires"
city_3 = "Edmonton"

# Extract data for cities
city_1_df = temperature_df[temperature_df['City'] == city_1].copy() # Use copy to avoid SettingWithCopyWarning
city_2_df = temperature_df[temperature_df['City'] == city_2].copy()
city_3_df = temperature_df[temperature_df['City'] == city_3].copy()

city_1_df.head()

             Region Country  State     City  Month  Day  Year  AvgTemperature
9266  North America  Canada    NaN  Calgary      1    1  1995            12.6
9267  North America  Canada    NaN  Calgary      1    2  1995             4.5
9268  North America  Canada    NaN  Calgary      1    3  1995             2.5
9269  North America  Canada    NaN  Calgary      1    4  1995            11.4
9270  North America  Canada    NaN  Calgary      1    5  1995            11.3

In [ ]:
# Create new Date column by aggregating Month, Day, and Year columns to MM/DD/YYYY format, then convert to DateTimeIndex

city_1_df['Date'] = pd.to_datetime(city_1_df['Month'].astype(str) + '/' + city_1_df['Day'].astype(str) + '/' + city_1_df['Year'].astype(str))
city_1_df = city_1_df.set_index('Date')

city_2_df['Date'] = pd.to_datetime(city_2_df['Month'].astype(str) + '/' + city_2_df['Day'].astype(str) + '/' + city_2_df['Year'].astype(str))
city_2_df = city_2_df.set_index('Date')

city_3_df['Date'] = pd.to_datetime(city_3_df['Month'].astype(str) + '/' + city_3_df['Day'].astype(str) + '/' + city_3_df['Year'].astype(str))
city_3_df = city_3_df.set_index('Date')

city_1_df.head()

                   Region Country  State     City  Month  Day  Year  AvgTemperature
Date
1995-01-01  North America  Canada    NaN  Calgary      1    1  1995            12.6
1995-01-02  North America  Canada    NaN  Calgary      1    2  1995             4.5
1995-01-03  North America  Canada    NaN  Calgary      1    3  1995             2.5
1995-01-04  North America  Canada    NaN  Calgary      1    4  1995            11.4
1995-01-05  North America  Canada    NaN  Calgary      1    5  1995            11.3

In [ ]:
# Keep only the columns we need
city_1_df = city_1_df[['AvgTemperature']]
city_2_df = city_2_df[['AvgTemperature']]
city_3_df = city_3_df[['AvgTemperature']]

city_1_df.head()

            AvgTemperature
Date
1995-01-01            12.6
1995-01-02             4.5
1995-01-03             2.5
1995-01-04            11.4
1995-01-05            11.3

# Q1

## (a)

In [ ]:
# Plot the time series of Microsoft and Apple stock prices on the same plot

## YOUR CODE STARTS HERE

**Enter answer here:**

## (b)

In [ ]:
# Downsample Microsoft stock data to weekly, monthly, quarterly, semi-annually and annually frequency

## YOUR CODE STARTS HERE

In [ ]:
# Plot the daily, weekly, monthly, quarterly, semi-annually and annually stock prices for Microsoft on the same plot (use figsize=(15, 10))

## YOUR CODE STARTS HERE

In [ ]:
# Downsample Apple stock data to weekly, monthly, quarterly, semi-annually and annually frequency

## YOUR CODE STARTS HERE

In [ ]:
# Plot the daily, weekly, monthly, quarterly, semi-annually and annually stock prices for Apple on the same plot (use figsize=(15, 10))

## YOUR CODE STARTS HERE

# Q2

In [ ]:
# Add a column to the monthly downsampled Microsoft dataframe (from Q1) called 'monthly_return'
# This column will contain the monthly return of the stock (use the pct_change() method)
# Then display the first 5 rows of the dataframe

## YOUR CODE STARTS HERE

In [ ]:
# Do the same for the monthly downsampled Apple dataframe

## YOUR CODE STARTS HERE

In [ ]:
# Plot the monthly return of Microsoft and Apple stocks on the same plot

## YOUR CODE STARTS HERE

**Enter answer here:**

# Q3

In [ ]:
# Smooth the monthly stock prices of Microsoft using exponential smoothing with alpha = 0.1, 0.4, 0.7, 0.9

## YOUR CODE STARTS HERE

In [ ]:
# Plot the monthly and smoothed monthly stock prices of Microsoft on the same plot (5 lines)

## YOUR CODE STARTS HERE

In [ ]:
# Smooth the monthly stock prices of Apple using exponential smoothing with alpha = 0.1, 0.4, 0.7, 0.9

## YOUR CODE STARTS HERE

In [ ]:
# Plot the monthly and smoothed monthly stock prices of Apple on the same plot (5 lines)

## YOUR CODE STARTS HERE

**Enter answer here:**

# Q4

## (a)

In [ ]:
# Plot temperature data for each city in different subplots

## YOUR CODE STARTS HERE

**Enter answer here:**

## (b)

In [ ]:
# Remove entries that aren't in intersection of all three indices (which are dates)

## YOUR CODE STARTS HERE

In [ ]:
# Downsample the data to monthly

## YOUR CODE STARTS HERE

In [ ]:
# Apply exponential smoothing to temperature data with alpha = 0.4

## YOUR CODE STARTS HERE

In [ ]:
# Plot monthly smoothed temperature data for cities in different subplots

## YOUR CODE STARTS HERE

**Enter answer here:**

## (c)

In [ ]:
# Plot auto-correlation of the monthly smoothed temperature of cities in different subplots
# Hint: use pd.plotting.autocorrelation_plot()

## YOUR CODE STARTS HERE

**Enter answer here:**

## (d)

In [ ]:
# Plot cross-correlation between city pairs (Calgary and Buenos Aires, Calgary and Edmonton, Buenos Aires and Edmonton)
# Hint: use ccf() function from statsmodels.tsa.stattools

## YOUR CODE STARTS HERE

**Enter answer here:**